(*************************************************
 * 1. int listの和を求めるsumをつくりましょう
 *
 * val sum : int list -> int
 *************************************************)

(*************************************************
 * 2. 要素とリストを受け取り，リスト内に要素がにあればtrue，
 *    なければfalseを返す関数memberをつくりましょう
 *    同様に重複要素を取り除くunique，
 *    与えられた関数を満たす要素のみを返すfilterをつくりましょう
 *
 * val member : 'a * 'a list -> bool
 * val unique : 'a list -> 'a list
 * val filter : ('a -> bool) * 'a list -> 'a list
 *************************************************)

(*************************************************
 * 3. 2.でつくった関数をfoldl,foldrを使って書きなおしましょう
 *************************************************)

(*************************************************
 * 4.与えられたリストから2要素の組み合わせを返す関数をつくりましょう
 *
 * val allPair : 'a list -> ('a * 'a) list
 *
 * Example. allPair [1,2,3] = [(1,2), (1,3), (2,3)]
 *************************************************)

(*************************************************
 * 5. 与えられたint listをソートするsortをつくりましょう
 *    ソートアルゴリズム・効率は問いません
 *
 * val sort : int list -> int list
 *
 * Example. sort [2,3,1,5,6,4] = [1,2,3,4,5,6]
 *************************************************)
